# ----------------------------------------------------------------------------------------------------
# 데이터 프레임 (DataFrame) 삭제
# ----------------------------------------------------------------------------------------------------
# 패키지, 모듈 로딩-------------------------------------------------------------------------------------
import pandas as pd

# DF 객체 생성 ----------------------------------------------------------------------------------------
df1=pd.DataFrame({'name':['마징가','배트맨','원더우먼'],'kor':[87,91,69],'eng':[99,73,89],'sci':[71,95,62]})

# DF 데이터 확인
print(f'df1 =>\n{df1}')
print(f'df1.index => {df1.index}')
print(f'df1.columns => {df1.columns}')

# 행(row) 삭제 => 객체.drop( ) or 객체.drop(,axis=0) ----------------------------------------------------
# '배트맨' 행데이터 삭제하고 싶음
retDF=df1.drop(1)   # DF에 변경가하는 메서드는 기본적으로 복사본을 만드는거임 따라서 변수이름 줘야됨
                    # or (,inplace=True) 줘서 원본 변경 // inplace 디폴트값 False 따라서 안쓰면 복사본
print(retDF)        # inplace=True 하면 원본 바꾸니까 변수명 안줘도됨

# redDF에서 '원더우먼' 행데이터 삭제 및 원본 적용
ret=retDF.drop(2,inplace=True)
print(f'ret => \n{ret}')        # inplace=True 하면 원본 적용하고 반환값 x 따라서 ret=>None
print(f'retDF => \n{retDF}')


# 열(columns) 삭제 => 객체.drop(,axis=1) or 객체.drop(,axis='columns') -----------------------------------
# sci 컬럼 삭제
print(df1)
colDF=df1.drop('sci',axis=1)
print(colDF)


# ----------------------------------------------------------------------------------------------------
# 데이터 프레임 (DataFrame) 추가
# ----------------------------------------------------------------------------------------------------
# 행(row) 추가 => 변수명.loc['행 이름/인덱스']=값 -------------------------------------------------------
# df1에 추가하고 싶으면 => 이름, 국어, 영어, 과학
df1.loc['의적']=['홍길동',99,87,91] # 행이름 숫자도 가능
# df1.loc[4]=['0'] # 값의 수가 columns랑 매치안되서 오류

print(f'df1 =>\n{df1}')
print(f'df1.index => {df1.index}') # 1,2,3,'의적' 이라서 object 타입


# 열(column) 추가 => 변수명['열 이름/인덱스']=값 --------------------------------------------------------
df1['math']=[52,44,72,60]
#df1['math2']=[100] # 값의 수가 row랑 매치안되서 오류

print(f'df1 =>\n{df1}')
print(f'df1.columns => {df1.columns}')